In [1]:
import pandas as pd
dictionary = {  "NAME":["ali","veli","kenan","hilal","ayse","evren"],
                "AGE":[15,16,17,33,45,66],
                "SALARY": [100,150,240,350,110,220]} 
dataFrame1 = pd.DataFrame(dictionary) # Verilen bir listi (dict) kullanarak, bir veri tablosu oluşturur.
dataFrame1

    NAME  AGE  SALARY
0    ali   15     100
1   veli   16     150
2  kenan   17     240
3  hilal   33     350
4   ayse   45     110
5  evren   66     220

In [2]:
dataFrame1["AGE"] # numpy ve listten farklı olarak index de yazılır.

0    15
1    16
2    17
3    33
4    45
5    66
Name: AGE, dtype: int64

In [3]:
dataFrame1.AGE # second method

0    15
1    16
2    17
3    33
4    45
5    66
Name: AGE, dtype: int64

In [4]:
dataFrame1["new_feature"] = [-1,-2,-3,-4,-5,-6] # feature ismine boşluk bırakma. :)
dataFrame1

    NAME  AGE  SALARY  new_feature
0    ali   15     100           -1
1   veli   16     150           -2
2  kenan   17     240           -3
3  hilal   33     350           -4
4   ayse   45     110           -5
5  evren   66     220           -6

> loc: (String **Location**) Access a group of rows and columns by **label(s)** or a boolean array.

In [5]:
dataFrame1.loc[:, "AGE"] # tüm satırlarını ve "AGE" sütununu alır.

0    15
1    16
2    17
3    33
4    45
5    66
Name: AGE, dtype: int64

> Aşağıdaki :3 ya da 0:3 değeri, List ve Numpy'da bu 3 exclusive, fakat pandas'ta inclusive'dir! :)

In [6]:
dataFrame1.loc[:3, "AGE"] # 0'dan : 3'e kadar satırları(3 dahil) ve AGE sütunundaki verileri salır. :3 yerine 0:3 te yazabilirdik.

0    15
1    16
2    17
3    33
Name: AGE, dtype: int64

In [7]:
dataFrame1.loc[0:3, "NAME":"SALARY"] # name'den salary sütununa kadar ve 0'dan 3. satıra kadar(3 inclusive) yazdırır.

    NAME  AGE  SALARY
0    ali   15     100
1   veli   16     150
2  kenan   17     240
3  hilal   33     350

In [8]:
dataFrame1.loc[0:3, ["NAME","AGE"]] # yalnızca name ve age sütunları ve 0'dan 3. satıra kadar(3 inclusive) yazdırır.

    NAME  AGE
0    ali   15
1   veli   16
2  kenan   17
3  hilal   33

In [9]:
dataFrame1.loc[::-1,:] # reverse all data

    NAME  AGE  SALARY  new_feature
5  evren   66     220           -6
4   ayse   45     110           -5
3  hilal   33     350           -4
2  kenan   17     240           -3
1   veli   16     150           -2
0    ali   15     100           -1

In [10]:
dataFrame1.loc[:, :"AGE"] # tüm satırları yazdır ancak bana buradan AGE'e kadar olan sütunları yazdır.
# print(dataFrame1.loc[:, 0 :"AGE"]) # iki si de aynı

    NAME  AGE
0    ali   15
1   veli   16
2  kenan   17
3  hilal   33
4   ayse   45
5  evren   66

> iloc: **(Integer Location)** Purely integer-location based indexing for selection by position.
>
> .iloc[] is primarily integer position based (from 0 to length-1 of the axis)

In [11]:
dataFrame1.iloc[:,1] # 1. indexte Age sütunu var.

0    15
1    16
2    17
3    33
4    45
5    66
Name: AGE, dtype: int64

In [12]:
dataFrame1.loc[3, ["AGE","NAME"]] # 3. indexin age ve name'ini bastırır.

AGE        33
NAME    hilal
Name: 3, dtype: object